'''
11. Матриця 5x4 заповнюється введенням з клавіатури (крім останніх елементів рядків).
    Програма повинна обчислювати суму введених елементів кожного рядка 
    і записувати її в останній рядок. Наприкінці слід вивести отриману матрицю.
'''

'''
не уверен что понял задание. в моем понимании есть где-то опечатка, и нам необходимо:
 - или сумму значений ряда записать в крайний столбец (тогда вроде сходится с формулировкой - 
   "заповнюється введенням з клавіатури (крім останніх елементів рядків)");
 - или сумму значений ряда записывать в крайний ряд (т.е. накидывать в матрицу еще один рядок,
   но как тогда быть с фразой  "заповнюється введенням з клавіатури (крім останніх елементів рядків)");
 - или есть еще какой-то вариант который я к сожалению не увидел.

 результат сделан по превому предположению, дай плиз знать если все же нужно было сделать иначе
'''

from vt_helper import get_user_input_numbers
from vt_helper import print_matrix

# set matrix size:
n = 4
m = 3

# set matrix values:
matrix = []
for i in range(n):
    row = []
    for j in range(m-1):
        print(f"matrix[{i+1}][{j+1}] = ", end = '')
        row.append(get_user_input_numbers())
    row.append(sum(row))
    matrix.append(row)

# display results
print_matrix(matrix)
