#У другому списку зберегти індекси парних елементів першого списку. Наприклад,
#якщо дано список зі значеннями 8, 3, 15, 6, 4, 2, то другий треба заповнити значеннями 1, 4, 5, 6
#(або 0, 3, 4, 5 - якщо індексація починається з нуля),
#оскільки саме в цих позиціях першого масиву стоять парні числа.

mylist = []
mylist_positive = []
x = 0
for i in range(-5,10):
    mylist.append(i)
    print(mylist)
while x < len(mylist):
    if mylist[x] < 0:
        mylist.remove(mylist[x])
        continue
    x += 1
    print(mylist)